#ifndef __CL_APPLICATION__H
#define __CL_APPLICATION__H
#include "cl_base.h"
/*#include "cl_1.h"
#include "cl_2.h"
#include "cl_3.h"	
#include "cl_4.h"
#include "cl_5.h"*/
#include "cl_cargo.h"
#include "cl_cargoareas.h"
#include "cl_controlpanel.h"
#include "cl_housearea.h"
#include "cl_reader.h"
#include "cl_screen.h"

class cl_application : public cl_base {
	//----------------------------------------------------------КВ-5--------------------------------------------------------------//
	std::string application_commad;
	//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
public:
	cl_application(cl_base* p_head); //Конструктор класса
	//----------------------------------------------------------КВ-5--------------------------------------------------------------//

	void build_tree_objects_4();
	int exec_app_4();
	void signal_from_app_into_reader(std::string& msg);
	void app_handler(std::string msg);
	//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	//----------------------------------------------------------КВ-4--------------------------------------------------------------//

	void build_tree_objects_3(); //Метод для инициализации объектов дерева
	int exec_app_3(); //Метод запуска приложения
	void setup_connection();
	//
	void signal_f(std::string& msg);
	void handler_f(std::string msg);
	//
	//----------------------------------------------------------КВ-3--------------------------------------------------------------//

	void build_tree_objects_2(); //Метод для инициализации объектов дерева
	int exec_app_2(); //Метод запуска приложения

	//----------------------------------------------------------КВ-2--------------------------------------------------------------//

	void build_tree_objects_1(); //Дополнительный метод для инициализации объектов дерева
	int exec_app_1(); //Метод запуска приложения

	//----------------------------------------------------------КВ-1--------------------------------------------------------------//

	//void build_tree_objects(); //Метод для инициализации объектов дерева
	//int exec_app(); //Метод запуска приложения
};

#endif
